#include <iostream>
#include "basics.h"
#include "shop/Laptop.h"

void basics() {
	std::cout << "OOP Basics!" << std::endl;
	Laptop* acer = new Laptop();
	acer->setName("Acer Nitro");
	acer->setPrice(64099);
	acer->setPower(90);
	acer->setHardware("NVIDIA RTX 3050 4GB VRAM, Intel Core i5, 16 GB RAM DDR5, SSD 1TB");
	std::cout << acer->toString() << std::endl;
}

/*
Основні принципи ООП.
Абстрагування, спадкування, поліморфізм, інкапсуляція

Абстракція - термін, що означає поєднання деякої множини сутностей.
Приклад - природна мова. Майже будь-яке слово значить множину.
"Телефон" - множина реальних речей
Машинним мовам абстракція не властива, інструкції мають чітке вираження.
Абстрагування - побудова мовних конструкцій, здатних поєднувати
множинні властивості (сутності та інші абстракції).

Створення абстракцій передбачає вивчення (аналіз) предметної області
(чому присвячена програма). Наприклад, крамниця. Виписуємо усі товари,
що мають бути в крамниці, з усіма їх важливими характеристиками.

Ноутбук				 Монітор			 Миша 				 Клавіатура
 - назва			  - назва			  - назва			  - назва
 - ціна				  - ціна			  - ціна			  - ціна
 - "залізо"			  - діагональ		  - DPI				  - тип
 - потужність		  - потужність		  - підключення		  - підключення 

1) Знаходимо, що є спільного у ВСІХ стуностей: назва та ціна
формуємо вищу абстракцію: товар (Product), що поєднує все, що в нас є
							Product
							- назва	   -- інкапсуляція - переміщення спільних
							- ціна		  властивостей до абстракцій
	  /					  /				  \					   \
Ноутбук				 Монітор			 Миша 				 Клавіатура
 - "залізо"			  - діагональ		  - DPI				  - тип
 - потужність		  - потужність		  - підключення		  - підключення
2) Знаходимо групи зі спільними властивостями і будуємо наступний рівень абстракцій
 Електротовари (-потужність)				 Периферія (-підключення)
							  Product
							- назва - ціна
						/					\
				  Електротовари			   Периферія
				   - потужність				- підключення
				/				\		     /			   \
			 Ноутбук		Монітор			 Миша		   Клавіатура
			  - "залізо"	 - діагональ	  - DPI			- тип
повторюємо п.2) для всіх можливих групувань
-----------------------
Спадкування - механізм реалізації абстрагування - створення класів на
базі інших класів з їх розширенням. Дочірній клас (нащадок) повністю
включає в себе батьківський клас і може додавати власні елементи.
Спадкування може бути каскадним, тобто Елктротовари спадкуються від Товару,
а Ноутбук - від Електротовару (а значить і від Товару). Але на відміну
від простого розширення, спадкування зберігає типізацію, тобто Ноутбук
окрім того, що сам є типом, також є типом Електротовар і Товар.

Д. З. Обрати предметну галузь для програмування (взяти з прикладів
популярних сайтів - формуи, оренда житла/автівок тощо)
Виписати основні стуності, провести абстрагування - побудувати
ієрархію класів з абстракціями. Основний результат - діаграма класів.
*/